from flask import Flask, render_template, request
from random import randint

app = Flask(__name__)

uwu = ['сука', 'выбля', 'чурко', 'хуе', 'манда', 'граче', 'дроче', 'блядо', 'члено', 'негро',
       'агро', 'фрико', 'гнидо', 'унисексо', 'говно', 'дристо', 'обдристо', 'порно',
       'сексо', 'жиро', 'ублюдо', 'фалло', 'хряко']

wuw = ['блядский', 'гнойный', 'хуевый', 'пидорский', 'плясный', 'ебаный', 'щегольской',
       'хрякий', 'мандовый', 'членовый', 'гнильный', 'речный', 'морский', 'зубый',
       'щелочный', 'завровый', 'лижущий', 'сжирающий', 'ублюдочный', 'плюшевый',
       'юродивый', 'шлюший', 'припизднутый', 'куртизанский', 'фаллосный', 'хряковый']

www = ['дроч', 'грач', 'хуй', 'пляс', 'хер', 'еб', 'глаз', 'луп', 'лом', 'пизд',
       'блядок', 'фуфел', 'пидор', 'сос', 'лиз', 'чмырь', 'ног', 'завр',
       'баклан', 'клапан', 'щель', 'пыжик', 'нюх', 'хряк', 'чушка', 'псинка']

@app.route("/", methods=["GET", "POST"])
def index():
    result = None
    if request.method == "POST":
        name = request.form["name"]
        result = f"{name} " \
                 f"{uwu[randint(0, len(uwu)-1)]}{wuw[randint(0, len(wuw)-1)]} " \
                 f"{uwu[randint(0, len(uwu)-1)]}{wuw[randint(0, len(wuw)-1)]} " \
                 f"{uwu[randint(0, len(uwu)-1)]}{www[randint(0, len(www)-1)]}"
    return render_template("index.html", result=result)

if __name__ == "__main__":
    app.run(host="0.0.0.0", port=5000)
